Albert2009Zi/Power_Supply_Control_PIC12F675/03_Software/Cooler_Control.X/interrupt.c
#include <xc.h>
#include <stdint.h>
#include "interrupt.h"
#include "init_periphery.h"

#define _XTAL_FREQ   4000000 

#define PWM_ON

uint16_t cnt1     = 0;
uint8_t  cnt0     = 0;
uint8_t  adcValue = 0; 

extern uint8_t measureType;
uint8_t errorType = ERROR_OK;

void MuxVoltage(void){ 
       ADCON0      = 0;                     /* must after every new switch be                          */ 
       ADON        = 1;                     /* ADC is ON                                               */
       ADFM        = 0;                     /* ADC results is left justified                          */
       CHS1        = 0;   
       CHS0        = 1;                     /* Enable ADC channel 1 (AN1) "Power ON button", ADC is ON */    
       measureType = VOLTAGE_MEASURE; 
       ADIF        = 0;
       __delay_ms(1);
       GO          = 1; 
}


void MuxTemp(void){
       ADCON0      = 0;                   /* must after every new switch be*/ 
       ADON        = 1;                   /* ADC is ON                                       */
       ADFM        = 0;                   /* ADC results is left justified                          */
       CHS1        = 0;   
       CHS0        = 0;                   /* Enable ADC channel 0 (AN0) "Temperature control", ADC is ON    */ 
       measureType = TEMPERATURE_MEASURE;
       ADIF        = 0;
       __delay_ms(1);
       GO          = 1;    
}

void __interrupt() ISR(void)
{       
 
//##########################Timer0#####################################// 
    if (TMR0IF == 1){       // Timer0 is overload 
    
    TMR0 = 6;      // ???????? ??? ???????????? ????? 1 ?? ??? ???????????? 256
	cnt0++;
	TMR0IF   = 0;  // ?????????? ???? ?????????? ??????? 0       
     }
     
     
 //##########################Timer1#####################################//     
    if (TMR1IF == 1){
         
	 TMR1H = 0xFC;
	 TMR1L = 0x17; //1ms          Fosc/4 1000000/1000 = 1000Hz(1ms)  65535-1000 = 64535 (0xFC17)
    
         cnt1++;
	 
        TMR1IF = 0;   // ?????????? ???? ?????????? ??????? 1
    }
}

 //##########################ADC#####################################//  

void ADCProcessing(void){

   if (ADIF == 1){     
       
       adcValue = ADRESH;
      
      switch (measureType){
       case VOLTAGE_MEASURE: 

	if ((adcValue > 47) && (adcValue < 71)){
       GP5 = 0;
	   GP2 = 0;
       errorType = ERROR_OK;
           }  	
	 else if (adcValue <= 47) {
       GP5 = 1; 
	   errorType  = ERROR_UNDER_VOLTAGE; 
           }
         else if (adcValue >= 71){
           GP5 = 1;
	       errorType  = ERROR_OVER_VOLTAGE;
           }    
	 MuxTemp();
        break;
	
	
	case TEMPERATURE_MEASURE:
	
             if (adcValue < 50){
		      GP5       = 1;  
		      GP4       = 0;
           	  errorType = ERROR_OK;
		  }
                
              else if ((adcValue >= 50) && (adcValue < 232)){
		        GP4       = 0;
			errorType = ERROR_OK;
                       }
	       	       
	      else if ((adcValue >= 232) && (adcValue < 242)){ 
		        GP4 = 1;
			errorType = ERROR_OK;
                       }	
             else  {
		        GP4       = 1;
	                GP5       = 1;
                        errorType = ERROR_TMP_HIGH;  		
		   }
		
	  MuxVoltage();
	    
	break;
	
	default:
	break;
	}  
    }   
   } 

